InformationRegisters/ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Атрибуты</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭлементКонструктора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыКонструктораВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеЭлементаКонструктораВидовПродукцииИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияЭлементовКонструктораВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияЭлементовКонструктораВидовПродукцииИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Атрибуты</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭлементКонструктора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыКонструктораВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеЭлементаКонструктораВидовПродукцииИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ПриЗагрузкеКлассификатора(ДанныеКлассификатора, ПараметрыЗагрузки, РезультатОбновления) Экспорт
	
	Блокировка = Новый БлокировкаДанных();
	Блокировка.Добавить(Метаданные.РегистрыСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС.ПолноеИмя());
	
	Попытка
		Блокировка.Заблокировать();
		ОбновитьЗначенияЭлементовКонструктораИзКлассификатора(ДанныеКлассификатора, ПараметрыЗагрузки);
		
	Исключение
		ТекстОшибкиПодробно = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		РезультатОбновления.СообщениеОбОшибке = ТекстОшибкиПодробно;
		РезультатОбновления.УспешнаяЗагрузка  = Ложь;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбновитьЗначенияЭлементовКонструктораИзКлассификатора(ДанныеКлассификатора, ПараметрыЗагрузки)
	
	Идентификаторы                 = ПараметрыЗагрузки.Идентификаторы;
	ЗначенияЭлементовКонструктора  = ДанныеКлассификатора.ЗначенияЭлементовКонструктора;
	ПараметрыЭлементовКонструктора = Справочники.ЭлементыКонструктораВидовПродукцииИС.ПараметрыЭлементовКонструктора();
	ПолноеИмяСправочникаЭлементов  = Метаданные.Справочники.ЭлементыКонструктораВидовПродукцииИС.ПолноеИмя();
	ИмяТаблицыВидовПродукции       = Метаданные.Справочники.ВидыПродукцииИС.ПолноеИмя();
	
	ЭлементыКЗаписиКомментария = Новый ТаблицаЗначений;
	ЭлементыКЗаписиКомментария.Колонки.Добавить("ЭлементКонструктора", Новый ОписаниеТипов("СправочникСсылка.ЭлементыКонструктораВидовПродукцииИС"));
	ЭлементыКЗаписиКомментария.Колонки.Добавить("Комментарий", ОбщегоНазначения.ОписаниеТипаСтрока(1000));
	
    Для Каждого ЗначениеЭлементаКонструктора Из ЗначенияЭлементовКонструктора Цикл
		СтруктураПоиска = Новый Структура;
        СтруктураПоиска.Вставить("ИмяТаблицы",   ПолноеИмяСправочникаЭлементов);
        СтруктураПоиска.Вставить("Наименование", ЗначениеЭлементаКонструктора.ЭлементКонструктора);
		
		НайденныеСтроки = Идентификаторы.НайтиСтроки(СтруктураПоиска);

		Если НайденныеСтроки.Количество() Тогда
			ЭлементКонструктораСсылка = НайденныеСтроки[0].Ссылка;
		Иначе
			ВызватьИсключение СтрШаблон(НСтр(
				"ru = 'Внутренняя ошибка поиска элемента конструктора %1'"),
				ЗначениеЭлементаКонструктора.ЭлементКонструктора);
		КонецЕсли;
		
		ПараметрыЭлементаКонструктора = ПараметрыЭлементовКонструктора.Получить(ЭлементКонструктораСсылка);

        Если ЭлементКонструктораСсылка.Комментарий <> ЗначениеЭлементаКонструктора.Комментарий Тогда
			ЭлементКЗаписиКомментария = ЭлементыКЗаписиКомментария.Добавить();
			ЭлементКЗаписиКомментария.ЭлементКонструктора = ЭлементКонструктораСсылка;
			ЭлементКЗаписиКомментария.Комментарий         = ЗначениеЭлементаКонструктора.Комментарий;
        КонецЕсли;
        
        СтруктураПоиска = Новый Структура;
        СтруктураПоиска.Вставить("ИмяТаблицы",    ИмяТаблицыВидовПродукции);
        СтруктураПоиска.Вставить("Идентификатор", ЗначениеЭлементаКонструктора.ВидПродукцииИдентификатор);
        СтруктураПоиска.Вставить("Наименование",  ЗначениеЭлементаКонструктора.ВидПродукцииНаименование);
        
		НайденныеСтроки = Идентификаторы.НайтиСтроки(СтруктураПоиска);

		Если НайденныеСтроки.Количество() Тогда
			ВидПродукцииСсылка = НайденныеСтроки[0].Ссылка;
		Иначе
			Продолжить;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(ВидПродукцииСсылка) Тогда
			Продолжить;
		КонецЕсли;

		ЗначениеИзКлассификатора = РегистрыСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС.ЗначениеЭлементаКонструктораИзКлассификатора(
			ЗначениеЭлементаКонструктора.ТипЗначения, ЗначениеЭлементаКонструктора.Значение, ЗначениеЭлементаКонструктора.НаименованиеЗначения,
			ЗначениеЭлементаКонструктора.ИдентификаторЗначения, ЗначениеЭлементаКонструктора.КлючЗначения, Идентификаторы);
        
        Если ЗначениеЗаполнено(ЗначениеЭлементаКонструктора.Значение) И ЗначениеИзКлассификатора = Неопределено Тогда
			Продолжить;
        КонецЕсли;
        
        НаборЗначений = СоздатьНаборЗаписей();
		НаборЗначений.Отбор.ЭлементКонструктора.Установить(ЭлементКонструктораСсылка);
		НаборЗначений.Отбор.ВидПродукции.Установить(ВидПродукцииСсылка);
		
		Если ПараметрыЭлементаКонструктора.Параметризуется
			И Не ПараметрыЭлементаКонструктора.КаждомуВидуПродукцииСоответствуетОдноЗначение Тогда
			НаборЗначений.Отбор.Значение.Установить(ЗначениеИзКлассификатора);
		КонецЕсли;

		НаборЗначений.Прочитать();

		Если НаборЗначений.Количество() Тогда
			ЗаписьЗначенияЭлемента = НаборЗначений[0];
		Иначе
			ЗаписьЗначенияЭлемента = НаборЗначений.Добавить();
		КонецЕсли;

		ЗаписьЗначенияЭлемента.ЭлементКонструктора = ЭлементКонструктораСсылка;
		ЗаписьЗначенияЭлемента.ВидПродукции        = ВидПродукцииСсылка;
		ЗаписьЗначенияЭлемента.Значение            = ЗначениеИзКлассификатора;
		ЗаписьЗначенияЭлемента.ПометкаУдаления     = ЗначениеЭлементаКонструктора.ПометкаУдаления;

		Если ПараметрыЭлементаКонструктора.ИспользоватьАтрибуты И ЗначениеЭлементаКонструктора.Атрибуты.Количество() > 0 Тогда
			СтруктураАтрибута = Новый Структура;

			Для Каждого СтрокаАтрибута Из ЗначениеЭлементаКонструктора.Атрибуты Цикл
				ЗначениеАтрибута = РегистрыСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС.ЗначениеЭлементаКонструктораИзКлассификатора(
					СтрокаАтрибута.ТипЗначения, СтрокаАтрибута.Значение, СтрокаАтрибута.НаименованиеЗначения,
					СтрокаАтрибута.ИдентификаторЗначения, СтрокаАтрибута.КлючЗначения, Идентификаторы);

				СтруктураАтрибута.Вставить(СтрокаАтрибута.Атрибут, ЗначениеАтрибута);

			КонецЦикла;

			ЗаписьЗначенияЭлемента.Атрибуты = Новый ХранилищеЗначения(СтруктураАтрибута);

		КонецЕсли;
        
		НаборЗначений.Записать();
        
	КонецЦикла;
    
    Если ЭлементыКЗаписиКомментария.Количество() Тогда
		ЭлементыКЗаписиКомментария.Свернуть("ЭлементКонструктора, Комментарий");
		
		Для каждого ЭлементКонструктора Из ЭлементыКЗаписиКомментария Цикл
			ОбъектЭлементКонструктора = ЭлементКонструктораСсылка.ПолучитьОбъект();
			ОбъектЭлементКонструктора.Комментарий = ЭлементКонструктора.Комментарий;
			ОбъектЭлементКонструктора.Записать();
		КонецЦикла;
		
    КонецЕсли;
    		
КонецПроцедуры

Процедура СинхронизироватьЗначенияСОсновнымРегистром() Экспорт

	Блокировка = Новый БлокировкаДанных();
	Блокировка.Добавить(Метаданные.РегистрыСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС.ПолноеИмя());
	
	НачатьТранзакцию();

	Попытка
		УдалитьДублирующиесяСОсновнымРегистромЗначения();

		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
		ТекстОшибкиПодробно = СтрШаблон(
		НСтр("ru = 'Ошибка при синхронизации пользовательских значений с основным регистром:
			 |%1'"), ОбработкаОшибок.ПодробноеПредставлениеОшибки(
			ИнформацияОбОшибке()));
		ОбщегоНазначенияИСВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(
		ТекстОшибкиПодробно, НСтр("ru = 'Работа с классификаторами'", ОбщегоНазначения.КодОсновногоЯзыка()));

		ВызватьИсключение ТекстОшибкиПодробно;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура УдалитьДублирующиесяСОсновнымРегистромЗначения()
	
	ПараметрыЭлементовКонструктора = Справочники.ЭлементыКонструктораВидовПродукцииИС.ПараметрыЭлементовКонструктора();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС.ЭлементКонструктора КАК ЭлементКонструктора,
		|	ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС.ВидПродукции КАК ВидПродукции,
		|	ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС.Значение КАК Значение,
		|	ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС.Атрибуты КАК Атрибуты,
		|	ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС.ПометкаУдаления КАК ПометкаУдаления,
		|	ЗначенияЭлементовКонструктораВидовПродукцииИС.Атрибуты КАК АтрибутыОсновнойЗаписи,
		|	ЕСТЬNULL(ЗначенияЭлементовКонструктораВидовПродукцииИС.ЭлементКонструктора, НЕОПРЕДЕЛЕНО) КАК ЭлементКонструктораОсновнойЗаписи
		|ИЗ
		|	РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС КАК ЗначенияЭлементовКонструктораВидовПродукцииИС
		|		ПО ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС.ЭлементКонструктора = ЗначенияЭлементовКонструктораВидовПродукцииИС.ЭлементКонструктора
		|			И ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС.ВидПродукции = ЗначенияЭлементовКонструктораВидовПродукцииИС.ВидПродукции
		|			И ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС.Значение = ЗначенияЭлементовКонструктораВидовПродукцииИС.Значение";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		УдалитьЗапись = Ложь;
		
		Если ВыборкаДетальныеЗаписи.ЭлементКонструктораОсновнойЗаписи = Неопределено Тогда
			Если ВыборкаДетальныеЗаписи.ПометкаУдаления Тогда
				УдалитьЗапись = Истина;
			КонецЕсли;
			
		Иначе
			Если ВыборкаДетальныеЗаписи.ПометкаУдаления Тогда
				Продолжить;
			КонецЕсли;
			
			ПараметрыЭлементаКонструктора  = ПараметрыЭлементовКонструктора.Получить(ВыборкаДетальныеЗаписи.ЭлементКонструктора);
			ХешАтрибутовОсновнойЗаписи     = "";
			ХешАтрибутовЗаписиПользователя = "";
			
			Если ПараметрыЭлементаКонструктора = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ПараметрыЭлементаКонструктора.ИспользоватьАтрибуты Тогда
				АтрибутыОсновнойЗаписи         = ВыборкаДетальныеЗаписи.АтрибутыОсновнойЗаписи.Получить();
				АтрибутыЗаписиПользователя     = ВыборкаДетальныеЗаписи.Атрибуты.Получить();
				
				Если АтрибутыОсновнойЗаписи <> Неопределено И АтрибутыОсновнойЗаписи.Количество() > 0 Тогда
					СписокАтрибутов = Новый СписокЗначений;
					Для Каждого Атрибут Из АтрибутыОсновнойЗаписи Цикл
						СписокАтрибутов.Добавить(Атрибут.Значение);
					КонецЦикла;
					СписокАтрибутов.СортироватьПоЗначению();
					СтрокаДляРасчетаХеша       = СтрСоединить(СписокАтрибутов.ВыгрузитьЗначения());
					ХешАтрибутовОсновнойЗаписи = ОбщегоНазначенияИС.ХэшСуммаСтроки(СтрокаДляРасчетаХеша);
				КонецЕсли;
				
				Если АтрибутыЗаписиПользователя <> Неопределено И АтрибутыЗаписиПользователя.Количество() > 0 Тогда
					СписокАтрибутов = Новый СписокЗначений;
					Для Каждого Атрибут Из АтрибутыЗаписиПользователя Цикл
						СписокАтрибутов.Добавить(Атрибут.Значение);
					КонецЦикла;
					СписокАтрибутов.СортироватьПоЗначению();
					СтрокаДляРасчетаХеша           = СтрСоединить(СписокАтрибутов.ВыгрузитьЗначения());
					ХешАтрибутовЗаписиПользователя = ОбщегоНазначенияИС.ХэшСуммаСтроки(СтрокаДляРасчетаХеша);
				КонецЕсли;
				
			КонецЕсли;
			
			Если ХешАтрибутовОсновнойЗаписи = ХешАтрибутовЗаписиПользователя Тогда
				УдалитьЗапись = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		Если УдалитьЗапись Тогда
			МенеджерЗаписи = СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ЭлементКонструктора = ВыборкаДетальныеЗаписи.ЭлементКонструктора;
			МенеджерЗаписи.ВидПродукции        = ВыборкаДетальныеЗаписи.ВидПродукции;
			МенеджерЗаписи.Значение            = ВыборкаДетальныеЗаписи.Значение;
			
			МенеджерЗаписи.Удалить();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
